ci4/app/Views/layout/main.php

// Coba ambil artikel terkini dengan error handling
try {
    $model = new \App\Models\ArtikelModel();
    $artikel = $model->orderBy('id', 'DESC')->limit(5)->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5