ci4/app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `useremail` = 'aziztriramadhan29@gmail.com'
AND `is_active` = 1
 LIMIT 1
---
    public function getUserByEmail($email)
    {
        return $this->where('useremail', $email)
                   ->where('is_active', 1)
                   ->first();

UPDATE `user` SET `last_login` = '2026-04-07 08:47:21'
WHERE `user`.`id` IN ('6')
---
    public function updateLastLogin($userId)
    {
        return $this->update($userId, ['last_login' => date('Y-m-d H:i:s')]);