ci4/app/Controllers/DebugLogin.php

SELECT *
FROM `user`
---
    public function index()
    {
        echo "<h1>DEBUG LOGIN SYSTEM</h1>";

        try {
            // Test database connection
            $db = \Config\Database::connect();
            echo "<p>Database connection: <strong>OK</strong></p>";

            // Test UserModel
            $model = new UserModel();
            echo "<p>UserModel created: <strong>OK</strong></p>";

            // Test get all users
            $users = $model->findAll();