ci4/app/Controllers/User.php

    public function dashboard()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/user/login');
        }

        $title = 'User Dashboard';
        $model = new UserModel();
        $totalUsers = $model->countAll();
        $recentUsers = $model->orderBy('created_at', 'DESC')->limit(5)->findAll();
---
SELECT COUNT(*) AS `numrows` FROM `user`
SELECT *
FROM `user`
ORDER BY `created_at` DESC
 LIMIT 5